In [113]:
import pandas as pd
import numpy as np

Series no Pandas

In [114]:
labels = ['a', 'b', 'c']

In [115]:
minha_lista = [10, 20, 30] # Definindo uma lista
arr = np.array([10, 20, 30]) # Array do numpy
d = {'a': 10, 'b': 20, 'c': 30} # Definindo um dicionário

In [116]:
series = pd.Series(data=minha_lista, index=labels) # Criando uma série utilizando como dados a lista, e como index a lista de letras.
series

a    10
b    20
c    30
dtype: int64

In [117]:
series['b'] # Puxando o valor pelo index

20

In [118]:
pd.Series(minha_lista, labels) # Criando novamente mas sem especificar os parametros.

a    10
b    20
c    30
dtype: int64

In [119]:
pd.Series(labels, minha_lista) # Criando a série mas ao contrário

10    a
20    b
30    c
dtype: object

In [120]:
pd.Series(arr, labels) # criando agora com o array e com os labels. Automaticamente ele identifica o a lista do numpy como conteúdo e nao como index nesse caso

a    10
b    20
c    30
dtype: int64

In [121]:
ser1 = pd.Series([1, 2, 3, 4], index = ['EUA', 'Alemanha', 'URSS', 'Japão']) # Criando uma série de países
ser1

EUA         1
Alemanha    2
URSS        3
Japão       4
dtype: int64

In [122]:
ser2 = pd.Series([1, 2, 3, 4], index = ['Alemanha', 'EUA', 'Itália', 'Japão']) # Criando outra série de países
ser2

Alemanha    1
EUA         2
Itália      3
Japão       4
dtype: int64

In [123]:
ser1 + ser2 # Fazendo uma soma dos valores no qual os países são iguais, como itália e urss só aparecem em cada uma das 
# séries, então o valor acaba ficando vazio.

Alemanha    3.0
EUA         3.0
Itália      NaN
Japão       8.0
URSS        NaN
dtype: float64

Data Frame no Pandas

In [124]:
np.random.seed(101) # definindo um gerador para o random, a mesma sequencia de números aleatórios será gerada toda vez
# que o código for executado

In [125]:
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(), columns = 'W X Y Z'.split()) # criando o data frame
# Função split para separar as strings em uma lista.

In [126]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [127]:
df['W'] # Buscando os valores da coluna

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [128]:
type(df['W']) # Quando busca o valor de uma coluna, a resposta é uma serie

pandas.core.series.Series

In [129]:
type(df)

pandas.core.frame.DataFrame

In [130]:
df[['W', 'Z']] # Passando uma lista como parametro para buscar mais de uma coluna

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [131]:
df['new'] = df['W'] + df['Z'] # Criando uma nova coluna, atribuindo os valores da linha com base em outras duas colunas

In [132]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [133]:
df.drop('new', axis=1, inplace = True) # Excluindo a coluna (comando inplace = true precisa ser aplicado para fazer a real alteração, nao apenas
# nesse mas em todas as função de alteração de um dataframe no pandas).

In [134]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [135]:
df.loc['A', 'W'] # Buscando um valor exato, por linha e coluna.

2.706849839399938

In [136]:
df.loc[['A', 'B'], ['X', 'Y', 'Z']] # Buscando uma lista de valores, passando linhas e colunas como parametro.

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965

In [137]:
df.iloc[1:4, 2:] # Outra forma de fazer a pesquisa de linha e coluna, mas o comando iloc funciona por index e nao por nome.

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

In [138]:
bol = df > 0 # Criando o data frame de boolean verificando se os valores são maiores que 0

In [139]:
df[bol] # Aplicando o data frame boolean no padrão, dessa foram os valores que tem "False" são retirados do dataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [140]:
df[df['X'] > 0] # Filtrando o dataframe por uma condição, nesse caso, mostrando apenas as linhas onde o X é maior que 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [141]:
df[df['X'] > 0]['Y'] # Mostrando os valores Y onde o X é maior que 0

A    0.907969
C    0.528813
E    2.605967
Name: Y, dtype: float64

In [142]:
df[(df['W'] > 0) & (df['Y'] > 1)] # Aplicando mais de uma condição com a variável And (demonstrado pelo & comercial)

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [143]:
df.reset_index() # Resetando os index para o padrão (sequencia numérica começando do 0)

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [144]:
col = 'RS RJ SP AM SC'.split()
col

['RS', 'RJ', 'SP', 'AM', 'SC']

In [145]:
df['Estado'] = col # Criando uma nova coluna no dataframe

In [146]:
df

          W         X         Y         Z Estado
A  2.706850  0.628133  0.907969  0.503826     RS
B  0.651118 -0.319318 -0.848077  0.605965     RJ
C -2.018168  0.740122  0.528813 -0.589001     SP
D  0.188695 -0.758872 -0.933237  0.955057     AM
E  0.190794  1.978757  2.605967  0.683509     SC

In [147]:
df.set_index('Estado') # Definindo que agora os estados serão o index da coluna

               W         X         Y         Z
Estado
RS      2.706850  0.628133  0.907969  0.503826
RJ      0.651118 -0.319318 -0.848077  0.605965
SP     -2.018168  0.740122  0.528813 -0.589001
AM      0.188695 -0.758872 -0.933237  0.955057
SC      0.190794  1.978757  2.605967  0.683509

In [148]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2'] 
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
# Criando uma lista com duplas de dados, ou seja, [g1, 1], [g1, 2] etc
# Definindo também que o index será duplo, tendo basicamente um subindex.

In [149]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [150]:
inside

[1, 2, 3, 1, 2, 3]

In [151]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [152]:
df = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns=['A', 'B'])
df
# Definindo o dataframe com valores aleatórios para os dados, mas utilizando os multiindex criados anteriormente.

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [153]:
df.loc['G1'] # Buscando os valores para o index principal "G1"

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [154]:
df.loc['G1'].loc[1] # Buscando os valores que batem com o multiindex "G1" e "1"

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [155]:
df.index.names = ['Grupo', 'Número']
df
# Alterando o nome dos index. (pode ou não ter nomes).

                     A         B
Grupo Número
G1    1       0.302665  1.693723
      2      -1.706086 -1.159119
      3      -0.134841  0.390528
G2    1       0.166905  0.184502
      2       0.807706  0.072960
      3       0.638787  0.329646

In [156]:
df.xs(1, level='Número') # Filtra pelo sub index 1, dando como resultado uma amostra com o Index principal e os valores
# que batem com o subindex.

              A         B
Grupo
G1     0.302665  1.693723
G2     0.166905  0.184502

Dados Ausentes

In [157]:
d = {
    'A': [1, 2, np.nan],
    'B': [5, np.nan, np.nan],
    'C': [1, 2, 3]
}
# criando um dicionario com dados vazios

In [158]:
df = pd.DataFrame(d)
df
#criando dataframe com base no dicionario

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [159]:
df.dropna() # Função exclui as linhas onde possui dados vazios

     A    B  C
0  1.0  5.0  1

In [160]:
df.dropna(thresh=2) # Exclui as linhas onde possui dados vazios, porém com a condição trash = 2, significa que tem que ter pelo menos 2 dados
# vazios na linha.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [161]:
df['A'].fillna(value=df['A'].mean()) # função fillna preenche os valores da coluna A que estão vazios.
# nesse caso está passando como parametro para preenchimento que o valor seja a média dos outros valores da propria coluna A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [162]:
df.fillna(method='ffill') # Função para preencher porém passando o método ffill, que preenche o valor vazio com o ultimo valor que apareceu
# na mesma coluna

/tmp/ipykernel_146253/1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [163]:
df.ffill() # utilizando ffill como função invés de método.

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

Group By

In [164]:
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [165]:
df = pd.DataFrame(data)
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [166]:
group = df.groupby('Empresa')
group
# Agrupando os dados do dataframe pela empresa.

In [167]:
group.sum()
# Somando os valores que foram agrupados, inclui tanto as somas de valores como venda, como também as strings, por isso os nomes foram agrupados.

               Nome  Venda
Empresa
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [168]:
group.describe() # Passa uma descrição do grupo com vários dados.

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [169]:
group.count() # Faz a contagem de quantos dados foram agrupados por empresa.

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [170]:
group = df.groupby('Nome')
group
# Agrupando por nome

In [171]:
group.sum().loc['Amy'] # Puxando os dados do drupo, mas apenas onde o nome é Amy

Empresa    MSFT
Venda       340
Name: Amy, dtype: object

Concatenar, Juntar e Mesclar

In [172]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [173]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [174]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Concatenação

In [175]:
pd.concat([df1,df2,df3]) # Concatenação nada mais é do que juntar os dataframes, sem nenhum parametro.

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [176]:
pd.concat([df1,df2,df3],axis=1) # Faz a junção de forma horizontal, o que causou a duplicação de colunas e a criação de muitos valores vazios.

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [177]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [178]:
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

Mesclar

In [179]:
pd.merge(esquerda,direita,how='inner',on='key') # Mescla as duas tabelas com base em um valor, nesse caso através da chave.

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [180]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
esquerda

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [181]:
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})
direita

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [182]:
pd.merge(esquerda, direita, on=['key1', 'key2']) # mesclando com base em dois parametros.

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [183]:
pd.merge(esquerda, direita, how='outer', on=['key1', 'key2']) # mesclando mas de forma externa através do método outer
# serve para preservar as linhas, mas causa a criação de valores vazios

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [184]:
pd.merge(esquerda, direita, how='right', on=['key1', 'key2']) # mantém todas as chaves da direita

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [185]:
pd.merge(esquerda, direita, how='left', on=['key1', 'key2']) # mantém todas as chaves da esquerda

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

Juntar

In [186]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [187]:
direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [188]:
esquerda.join(direita) # Basicamente um atalho para o pd.merge que passa como parametro o método "left"

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [189]:
esquerda.join(direita, how='outer') # mesma coisa mas para o método outer.

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

Operações no Pandas

In [222]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()
# head() mostra basicamente a "cabeça" do dataframe, os dados do topo

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [191]:
df['col2'].unique() # Mostra os valores únicos(sem considerar as duplicadas) de uma coluna, 
#nesse caso passando como parametro a coluna 2

array([444, 555, 666])

In [192]:
np.unique(df['col2']) # Mesma coisa mas usando o numpy

array([444, 555, 666])

In [193]:
len(df['col2'].unique()) # verificando a quantidade de elementos "unicos" com a função que retorna o tamanho de uma lista ou serie

3

In [194]:
df['col2'].nunique() # Função nunique que faz a mesma coisa.

3

In [195]:
df['col2'].value_counts() # Pega os valores "únicos' da coluna, mas dessa vez mostra a contagem de quantas vezes cada um apareceu

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [196]:
df[(df['col1']>2) & (df['col2']==444)] # retorna o dataframe mas apenas com as linhas que correspondem a condição aplicada acima.

   col1  col2 col3
3     4   444  xyz

In [197]:
def vezes2(x):
    return x*2
#criando uma função que passado um valor x, retorna x multiplicado por 2

In [198]:
df.sum() # Soma todos os valores do dataframe por coluna

col1              10
col2            2109
col3    abcdefghixyz
dtype: object

In [199]:
df['col1'].sum() # Soma os valores da coluna 1

10

In [200]:
df['col1'].apply(vezes2) # Aplica uma função aos valores da coluna 1, nesse caso aplicando a função que eu mesmo criei

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [201]:
df['col3'].apply(len) # Retorna o tamanho da string de cada linha da coluna 3

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [202]:
df['col1'].apply(lambda x: x*x) # Aplica uma função lambda que eleva os valores da coluna um ao quadrado

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [203]:
del df['col2'] # Deleta a coluna 2 (método padrão do python, por isso é aplicado diretamente no dataframe)
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [204]:
df.columns # Retorna os nomes das colunas do dataframe

Index(['col1', 'col3'], dtype='object')

In [205]:
df.index # Retorna o nome os index do dataframe

RangeIndex(start=0, stop=4, step=1)

In [206]:
df.sort_values(by='col3') # Ordena o dataframe com base nos valores de uma coluna

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [207]:
df.isnull() # cria um dataframe boolean com os valores True para onde os valores do dataframe original estão vazios

    col1   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [208]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [209]:
df['col1'].fillna(value=df['col1'].mean(), inplace=True)
df
# preenchendo novamente com a média e com o método fillna (já havia feito isso anteriormente linhas de códigos atrás)

/tmp/ipykernel_146253/3966020495.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['col1'].fillna(value=df['col1'].mean(), inplace=True)

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   2.0  444.0  xyz

In [210]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [211]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C']) # Função para alterar o formato do dataframe.
#A e B serão os novos index do dataframe, as novas colunas serão os valores que antes eram da coluna C, os valores que devem ir na tabela
# são os valores que antes estavam na coluna D.

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

Entrada e saída de Dados

In [212]:
df = pd.read_csv('exemplo', sep=',') # lendo um arquivo csv para um dataframe

In [213]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [214]:
df = df + 1 # fazendo uma soma escalar para os valores do dataframe

In [215]:
df

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [216]:
df.to_csv('exemplo.csv', sep=';', decimal=',') #salvando o arquivo como csv

In [217]:
df = pd.read_excel('Exemplo_Excel.xlsx', sheet_name='Sheet1') #lendo uma planilha do excel como dataframe

In [218]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [219]:
df.to_excel('exemplo.xlsx', sheet_name='Sheet1') #salvando agora o dataframe como planilha do excel

In [220]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html') # lendo a partir de um site html

In [221]:
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523